app/views/categories/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."category_id" = $1  [["category_id", 1]]
---

<% @category.users.each do |user| %>